src/DataProcessors/Scan_НастройкаНаименованияИзделия/Scan_НастройкаНаименованияИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_НастройкаНаименованияИзделия</name>
  <attributes>
    <name>СправочникНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставляющиеАлгоритма</name>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/Scan_НастройкаНаименованияИзделия/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СправочникНастройки = "Scan_Изделия";
	Объект.РеквизитОбъекта = "Наименование";
	СписокРеквизитов = Обработки.Scan_НастройкаНаименованияИзделия.СформироватьСписокРеквизитов("Scan_Изделия");
	Элементы.СоставляющиеАлгоритмаФрагмент.СписокВыбора.ЗагрузитьЗначения(СписокРеквизитов);
	
	Если Параметры.СтараяНастройка <> "" Тогда
		ЗаполнитьТаблицуПоНастройке(Параметры.СтараяНастройка);
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытииОбработки(РеквизитФормыВЗначение("Объект").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры

&НаКлиенте
Процедура СоставляющиеАлгоритмаПриИзменении(Элемент)
	ОбновитьПредпросмотр();
КонецПроцедуры

//Процедура формирует текст для предпросмотра
&НаСервере
Процедура ОбновитьПредпросмотр()
	Предпросмотр = "";
	СЧ = 0;
	Для Каждого СтрокаТЧ ИЗ Объект.СоставляющиеАлгоритма Цикл
		СЧ = СЧ + 1;
		Если СЧ = 1 Тогда
			Предпросмотр = СтрокаТЧ.Фрагмент;
		Иначе	
			Предпросмотр = Предпросмотр + " + " + СтрокаТЧ.Фрагмент;
		КонецЕсли;
	КонецЦикла;
	Объект.НастройкаНаименования = Предпросмотр;
	
КонецПроцедуры //ОбновитьПредпросмотр()

&НаКлиенте
Процедура КомандаОК(Команда)
	
	УдалитьПустыеСтроки();
	
	ПараметрНастройки = Новый Структура;
	ПараметрНастройки.Вставить("НастройкаНаименования", Объект.НастройкаНаименования);

	Закрыть(ПараметрНастройки);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоНастройке(СтараяНастройка)
	Объект.НастройкаНаименования = СтараяНастройка;
	
	МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтараяНастройка, "+");
	Для Каждого СтрокаМассива Из МассивРеквизитов Цикл
		НоваяСтрока = Объект.СоставляющиеАлгоритма.Добавить();
		НоваяСтрока.Фрагмент = СокрЛП(СтрокаМассива);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьПустыеСтроки()
	Парам = Новый Структура;
	Парам.Вставить("Фрагмент","");
	СтрокиДляУдаления = Объект.СоставляющиеАлгоритма.НайтиСтроки(Парам);
	Для Каждого СтрокаТабл Из СтрокиДляУдаления Цикл
		Объект.СоставляющиеАлгоритма.Удалить(СтрокаТабл);
	КонецЦикла;
	ОбновитьПредпросмотр();	
КонецПроцедуры
